# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters

#107,90, 125,109, 137,113, 133,121, 145,121, 139,128, 148,131, 159,126, 147,140, 157,137, 174,139, 163,150, 210,132, 183,156, 196,177, 229,202

nc: 7  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 4  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   # تبدء من الصفر
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, CBAM, [128,3,2]],
   [-2, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, CBAM, [256,3,2]], #5  # ATM مدخخلات السبيشل بالفنكش مالته وتم تقليل مرتين ولذلك لان قبل C3
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, CBAM, [512,3,2]], #8  #Ading atm
   [-2, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9  
   [-1, 1, CBAM, [1024,3,2]],  #12 #Ading atm
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4 ## اضافة رقم بدل ال7 جانت 6
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3   غيرنا لل5#اهنااا الاضافة الخط الجديد
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # out put for 80*80
   [[-1, 18], 1, Concat, [1]],  # cat head P4    اضافة رقم بدل ال15 قبل 14
   [-1, 3, C3, [512, False]],  #  (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5  اضاة رقم لل11 قبل 10
   [-1, 3, C3, [1024, False]],  # 26 (P5/32-large)

   
   [-25, 3, C3, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 1, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat head P5  اضاة رقم لل11 قبل 10
   [-1, 3, C3, [128, False]],
   [[21, 24, 27,31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)   اضافة 1 الى كل 18 21 24
  ]
